In [1]:
import pandas as pd

In [4]:
x=pd.DataFrame({"RollNo":[1,2,3],"Name":["Ram","Sham","Pranav"]})

In [5]:
x

   RollNo    Name
0       1     Ram
1       2    Sham
2       3  Pranav

In [6]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  3 non-null      int64
 1   Name    3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [7]:
x.describe()

       RollNo
count     3.0
mean      2.0
std       1.0
min       1.0
25%       1.5
50%       2.0
75%       2.5
max       3.0

In [8]:
x.isnull()

   RollNo   Name
0   False  False
1   False  False
2   False  False

In [9]:
x=pd.DataFrame({"RollNo":[1,2,3],"Name":["Ram","Sham","Pranav"]})
x

   RollNo    Name
0       1     Ram
1       2    Sham
2       3  Pranav

In [10]:
x.dropnull()

AttributeError: 'DataFrame' object has no attribute 'dropnull'

In [11]:
x.duplicated()

0    False
1    False
2    False
dtype: bool

In [12]:
x

   RollNo    Name
0       1     Ram
1       2    Sham
2       3  Pranav

In [13]:
x.head(2)

   RollNo  Name
0       1   Ram
1       2  Sham

In [14]:
x.tail(1)

   RollNo    Name
2       3  Pranav

In [15]:
x.tail(2)

   RollNo    Name
1       2    Sham
2       3  Pranav

In [16]:
type(x)

pandas.core.frame.DataFrame

In [18]:
type(x.RollNo)

pandas.core.series.Series

In [19]:
type(x.Name)

pandas.core.series.Series